{"tasks":[{"id":12475470,"content":"*496 Zachry Smart Focus (C8) - Shipping Address","description":"We hard coded these orders to pull in the site champion for each job site, as the attention line for shipments. \nWE now need to include both the site champion and the author of the order/award recipient as well. \nIs there someway to pull this into the PO for the vendor to reference?","owner":{"firstname":"Mike","lastname":"French"}},{"id":12672998,"content":"*496 Zachry Smart Focus (C8) - Shipping Address Issue #2","description":"We also have an issue with this ship to: \nthe 2nd line of the address didn't pull into PO 3561935T. \nNot sure if this will continue to happen, so can you take a look and make sure? if it is, are other site addresses effected too? can you figure out a fix?\n\nJob Site/Suggestion Group INEOS CB\n\nZACHRY INDUSTRIAL \nFM 2004 \n2 MILES SOUTH OF THE INTERSECTION OFFM2917 AND FM2004 \nALVIN TX 77511","owner":{"firstname":"Mike","lastname":"French"}},{"id":13514626,"content":"*45A and *45B - Able to stop certain items from shipping internationally?","description":"*45A and *45B are both programs that we send international goods to - that is working well. However, each account has 1 item that we can't ship internationally. Is there a way to make it so that we put some sort of barrier on a given item so it can't be ordered with an international address (but the rest of the program/items can)?","owner":{"firstname":"Rory","lastname":"McGuire"}},{"id":13956988,"content":"*696 JHU Carey - Reminder Email","description":"Reminder Email\no   I’m sure this question is for Christa, but is it possible to have an automated reminder email sent out to people who come to the site, place items in their bag but do not make the purchase. I am thinking something like the example I have pictured below: \nSee attached image","owner":{"firstname":"Scott","lastname":"Stowe"}},{"id":14058580,"content":"*451 NSU - Email notifier for rep (live site only)","description":"Is the web team the one who can turn on notifications for a sales rep to receive emails when an order is received by the site?","owner":{"firstname":"Ashley","lastname":"Doughty"}},{"id":15332385,"content":"*11E, *11F AECOM CANADA - Live Inventory","description":"Please open a ticket with Avetti to question how live inventory can be kept on a non-integrated site where inventory is shared between skus and sites.\n\nI have learned how to upload inventory amounts into Avetti and the thought (Mike Plourde) was that Avetti would automatically deduct as items were ordered, we would only need to load new inventory as it is received and checked in.  However, one site *11E is a credit card site and one *11F is a punch out site.  My understanding is that Avetti would not keep track of the punch out orders or deduct inventory because it is just passing through.  Also, both sites mentioned share skus....and we have an English and a French version of each sku.  I'm open to troubleshooting this with someone.  \n\nLive global inventory is important to AECOM, so this is a priority.","owner":{"firstname":"Stephanie","lastname":"Hobbs"}},{"id":16256666,"content":"*435  Corporate Travel update order questions","description":"In the check out when asked for the order questions we need to be able to capture at least 4 of the  4T cost center codes and at least 3 of the T3 cost center codes.    They have to fill out at least one of each.\nIf you look at web order C8FC17071900001 the T4 codes got cut off.    if it can expand that would be ideal.  if not a second, third and fourth box.  Hoping we can just expand","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":17004520,"content":"AECOM EMIA Sites- payment","description":"Please see the below email:\n\nHi Kevin\nI hope you are well? Regarding the European website you created for AECOM, we are in the process of setting up a new MID to handle the Euro payments. The Gateway company is asking for the sitereference... I have one from last year which was test_btcgroupthree69378 but I was wondering if it has changed since then?\n\nThanks for your assistance in this matter,\n\nFaye Johnson | Design Manager\n020 8587 3363","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":17111139,"content":"Ingersoll Rand's President's Awards","description":"Create these as integrated google forms. they will need to email the client when responses come in. We are waiting for confirmation on if they will go on the portal site.","owner":{"firstname":"Mike","lastname":"Plourde"}},{"id":17238684,"content":"*376 BD - new disclaimer","description":"can we please add the following text to our checkout screen & order confirmation when an international country is selected ?\n\n\nPlease note that international shipments are subject to duties and customs fees above and beyond standard shipping charged by Geiger. These charges are the responsibility of the receiver and payment may be required before delivery of your package will be completed. Contact your local courier or customs office for details.","owner":{"firstname":"Rory","lastname":"McGuire"}},{"id":17542650,"content":"*451 NSU - Ship to address issue","description":"Orders are not pulling in the full ship to address. Missing street address each time. This has happened on the past three orders.\nEx 1862691 & 1866354","owner":{"firstname":"Ashley","lastname":"Doughty"}},{"id":17766319,"content":"*16A and *39A Vistana Birt tool getting and error","description":"The customer is getting a java exception.\n\nShe was pulling  report from the birt tool for employee ID 126704  when I go to pull the same report I get the same issue.","owner":{"firstname":"CPWEB","lastname":"Group"}},{"id":17792524,"content":"*11E AECOM CANADA Punch Out - Advantage Errors","description":"The \"title (French)\" is missing on most items and will not let the buyer process orders through advantage as this field is mandatory.","owner":{"firstname":"Stephanie","lastname":"Hobbs"}},{"id":18225285,"content":"*11E *11F AECOM Canada - CANHU11F3","description":"This item does not have a spot for French description, attributes, or title.","owner":{"firstname":"Stephanie","lastname":"Hobbs"}},{"id":18300579,"content":"*11A & *11B AECOM - New Category","description":"Please create following new categories:\n\nAECOM Tishman (Keyword *WEB TISHMAN)\nAECOM Hunt (Keyword *WEB HUNT)\n\nPlease keep these hidden until further notice. Thank you!","owner":{"firstname":"Jen","lastname":"Ruler"}},{"id":18561619,"content":"*379 USHW - Add Approval Modification /  Add order cc: e-mail to order confirmations","description":"Customer is requesting we put the approval modification in place for this program for every order. Every single order needs to be approved. Please have these approvals sent to CherylThomas@Concentra.com \n\nIn the meantime, could we please also have her added to get copied on every order confirmation?","owner":{"firstname":"Rory","lastname":"McGuire"}},{"id":18595596,"content":"AECOM Compatibility issue with IE","description":"Kevin please get prepared to have the region link redirected from AECOM to a url on our sub domain geigershops.com.  Please send me the url you want to use and I can coordinate with the client to test if this will solve their issue\n\nThanks,\n\nMike\n\nMichael J Plourde, MAS, CIL\nDIRECTOR DATA AND ANALYTICS\n\n[http://artflow2.geiger.com/signature/Geiger_files/image002.png]\n70 Mt Hope Ave * Lewiston, Me 04240\nPH. 207.755.2483 * C. 207.577.7052 * www.geiger.com<http://www.geiger.com/>\n\n[http://artflow2.geiger.com/signature/Geiger_files/image004.png]<https://www.facebook.com/geiger>   [http://artflow2.geiger.com/signature/Geiger_files/image006.png] <https://twitter.com/geigergetsit>    [http://artflow2.geiger.com/signature/Geiger_files/image008.png] <https://www.linkedin.com/company/geiger>\n#geigergetsit  * IT\n\nYour name and message showcased on a promotional product has impact like no other medium.  When a promotion is executed with just the right product and a creative flair, it's called Brandspiration. No firm has won more industry awards than ours. Let us use the power of Brandspiration to help you dazzle and inspire.","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18646221,"content":"*49I Univest maintenance page needed 8:00 AM on 5/24","description":"We have to hide the site so no one can order on 5/24 at 8:00 AM.  Use this as the maintenance page\n\nSorry for the inconvenience  the Univest Brand Store in currently down for Maintenance.\n        We are preparing for the new stipends.  We will be back up on June 1st.","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":18671744,"content":"*31B TAA & *31A TAP - Items in Search","description":"The following items are appearing for searches of the word 'pen', but this sequence of letters does not exist in the romance or the title for these items. Could you look into this please?\n\nVJM005\nVJU005\nASU003BLK\nASM003BLK\nAPM005NVY\n\nThank you!","owner":{"firstname":"Scott","lastname":"Stowe"}},{"id":18673612,"content":"*180 Oliver Wyman add roll over code","description":"Oliver Wyman v_15\nlines 91-113\nlines 231\nNEED TO ADD ROLLOVER CODE\n\nThis needs to be added to every logo sku, size etc..","owner":{"firstname":"Amy","lastname":"Law"}},{"id":18715856,"content":"IR Sites - check off items as discontinued","description":"Please see the attached SS, there is a tab for each individual site. All SKU's need to have the \"discontinued\" box checked off in the inventory screen.","owner":{"firstname":"Casey","lastname":"Conroy"}},{"id":18736530,"content":"Create a demo copy of the CRU Winter Conference site for Rob Kilgore","description":"it is OK to put this on Custer 1","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18773416,"content":"*33F and *33G - Valmont and Valley - New Promo Category","description":"Can you please create a Tradeshow Group Buy Category. Can you keep this hidden until 5/31 when the live date for the promo is.\n\nPlease let me know what the keyword is once it is set up.\n\nThanks!","owner":{"firstname":"Julie","lastname":"Vickers"}},{"id":18778758,"content":"*357 Polyglass items name file has changed but not showing change on site","description":"HI CP Web-\n\n on these three items the name was changed in glinx in the item file in all the places its supposed to be and its not showing changed on the web. This was done a while ago- not today. The word POLYGLASS needs to be removed. Can you check the back end and let me know how to fix this?\n\nItem:\nBZ2357411000000 POLYGLASS AUTHORIZED DISTRIBUTOR BANNER (SPANISH)\nBZ2357378000000 POLYGLASS HOO-RAGS\nCZ2357004000000 POLYGLASS HARD HAT\nCA2357018CHA000 POLYGLASS UNSTRUCTURED LOW PROFILE CHARCOAL CAP\nCA2357016CAM000 POLYGLASS REALTREE CAMO CHINO TWILL CAP\n\nThanks!","owner":{"firstname":"Amanda","lastname":"Bryant"}},{"id":18792357,"content":"Ingersoll Rand- Need to revise POP UP window on check out pages for all cags *INTERNATIONAL & DOMESTIC*","description":"***We need to update the POP UP window for international orders on the check out page on all cags to the following: \n\nPlease note that you have selected international shipping for this order. \nYour order confirmation will show no shipping total as we will send you an email quote for approval after your order is placed. \nDuties and Taxes will not be included in the quote but will be approximately 20% of your order total and will be billed separately (invoice will be sent out within 30-45 days after the order has shipped) \n\nFor all International orders please allow an additional 7 business days to account for transit and customs.\n\nDue to new restrictions from UPS/FEDEX on AIR shipping shipments of products with lithium ion batteries a sur charge of $50.00 per box will apply to the order (this is in addition to the freight estimate emailed to you). \n\n***For Domestic shipping orders- also create a pop up (to function just like the International one we have). \n\nDue to new restrictions from UPS/FEDEX on AIR shipping shipments of products with lithium ion batteries a sur charge of $50.00 per box will apply to the order (this is in addition to the freight estimate emailed to you).\nThis sur charge will not apply if shipping GROUND method. \n\nThe POP UP window still needs to have the I accept button for the client to click to confirm acknowledgement- for both international and domestic. \n\nCags\n*38A\n*38B\n*38C\n*38D\n*38E\n*38H\n*38J\n*38L","owner":{"firstname":"Juliana","lastname":"Rua"}},{"id":18795887,"content":"*55C Milestone - re-enable password change on site","description":"password change section of site has been hidden from the users on this site in the past -- please change the site to allow for password changes.","owner":{"firstname":"Kaitlynne","lastname":"Gibson"}},{"id":18799631,"content":"*204 GREAT  update FAQ","description":"•\tUnder FAQ (Customer Service) we need to change the email address from cs@geiger.com to jtreadway@geiger.com. The phone number shown rings in my office, not at Geiger.","owner":{"firstname":"Charly","lastname":"Dion"}},{"id":18800883,"content":"*498 PSCU - Auth. users","description":"Can a list of all authorized users be pulled. i already reached out to cs and they stated that CP web could pull this.","owner":{"firstname":"Ryan","lastname":"Mockler"}},{"id":18810929,"content":"*51C Hyundai Material Handling - Add category","description":"Please add a new category called CLOSEOUT in yellow text so that is pops. Let me know what the keyword will be.","owner":{"firstname":"Stella","lastname":"Duclos"}},{"id":18810943,"content":"*515 Hyundai CE - Closeout category","description":"Can you make the word CLOSEOUT text in bright yellow?  If so, please change.","owner":{"firstname":"Stella","lastname":"Duclos"}},{"id":18811066,"content":"*39B OCCM (SA)- New Subcategories","description":"Customer is requesting that under the Corporate Promo Category we have the following breakdown when you actually click on the word corporate (keep the current fly outs for Standard, Quarterly, and Last Call) \n\nWhen you click on corporate they want the items to break down all on one page under each of the categories: Do we need more subcategories to make that work, if so please use:\n\nStandard\n*WEB CORPST\n\nQuarterly\n*WEB CORPQR\n\nLast Call\n*WEB CORPLC","owner":{"firstname":"John","lastname":"Paine"}},{"id":18812534,"content":"Ingersoll Rand Corporate site *38A need new category /keyword -Trane Commercial Green","description":"Please create a new subcategory for *38A Trane Commercial (*WEB TB is the Green dot) \nplease name it - Controls 40th Anniversary \nkeyword to use is *WEB TB40","owner":{"firstname":"John","lastname":"Paine"}},{"id":18813410,"content":"*161 Vistana live chat is over budget","description":"the live chat got moved so you can't see the budgets screen shot provided in skype mgs","owner":{"firstname":"Joni","lastname":"Satterthwaite"}},{"id":18815529,"content":"Farmers Almanac store failure","description":"All of a sudden people are unable to order wedding letters, it won't let you enter the information. Please fix. Patrick","owner":{"firstname":"Kevin","lastname":"McGrory"}},{"id":18816487,"content":"*469 Masonite - Add James Sharpe's name to list of approvers in drop down during checkout process","description":"Please add James Sharpe's name to the approver list in the *469 checkout process (image attached for reference)","owner":{"firstname":"Zachary","lastname":"LeBlanc"}},{"id":18816918,"content":"*38A and *38J - please remove item IR-183-3X from both sites","description":"","owner":{"firstname":"Priscilla","lastname":"Thoreson"}},{"id":18817326,"content":"*55B LMC - add communities to BOTH script question dropdowns","description":"Axle \nValdok \n\n\nmaintain alphabetical order","owner":{"firstname":"Kaitlynne","lastname":"Gibson"}}]}